### Terraform `plan` Succeeded for Workspace: `stage`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.vpc.aws_eip.nat[0] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = (known after apply)
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Name"        = "jingood2-stage-vpc-ap-northeast-2a"
+           "environment" = "stage"
+           "owners"      = "jingood2"
        }
+       tags_all             = {
+           "Name"        = "jingood2-stage-vpc-ap-northeast-2a"
+           "environment" = "stage"
+           "owners"      = "jingood2"
        }
+       vpc                  = true
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
+   resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Name"        = "jingood2-stage-vpc"
+           "environment" = "stage"
+           "owners"      = "jingood2"
        }
+       tags_all = {
+           "Name"        = "jingood2-stage-vpc"
+           "environment" = "stage"
+           "owners"      = "jingood2"
        }
+       vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id        = (known after apply)
+       connectivity_type    = "public"
+       id                   = (known after apply)
+       network_interface_id = (known after apply)
+       private_ip           = (known after apply)
+       public_ip            = (known after apply)
+       subnet_id            = (known after apply)
+       tags                 = {
+           "Name"        = "jingood2-stage-vpc-ap-northeast-2a"
+           "environment" = "stage"
+           "owners"      = "jingood2"
        }
+       tags_all             = {
+           "Name"        = "jingood2-stage-vpc-ap-northeast-2a"
+           "environment" = "stage"
+           "owners"      = "jingood2"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
+   resource "aws_route" "public_internet_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name"        = "jingood2-stage-vpc-private"
+           "environment" = "stage"
+           "owners"      = "jingood2"
        }
+       tags_all         = {
+           "Name"        = "jingood2-stage-vpc-private"
+           "environment" = "stage"
+           "owners"      = "jingood2"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name"        = "jingood2-stage-vpc-public"
+           "environment" = "stage"
+           "owners"      = "jingood2"
        }
+       tags_all         = {
+           "Name"        = "jingood2-stage-vpc-public"
+           "environment" = "stage"
+           "owners"      = "jingood2"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[0] will be created
+   resource "aws_route_table_association" "database" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[1] will be created
+   resource "aws_route_table_association" "database" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.database[0] will be created
+   resource "aws_subnet" "database" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-northeast-2a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.3.151.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "jingood2-stage-vpc-db-ap-northeast-2a"
+           "Type"        = "Private Database Subnets"
+           "environment" = "stage"
+           "owners"      = "jingood2"
        }
+       tags_all                                       = {
+           "Name"        = "jingood2-stage-vpc-db-ap-northeast-2a"
+           "Type"        = "Private Database Subnets"
+           "environment" = "stage"
+           "owners"      = "jingood2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.database[1] will be created
+   resource "aws_subnet" "database" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-northeast-2c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.3.152.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "jingood2-stage-vpc-db-ap-northeast-2c"
+           "Type"        = "Private Database Subnets"
+           "environment" = "stage"
+           "owners"      = "jingood2"
        }
+       tags_all                                       = {
+           "Name"        = "jingood2-stage-vpc-db-ap-northeast-2c"
+           "Type"        = "Private Database Subnets"
+           "environment" = "stage"
+           "owners"      = "jingood2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-northeast-2a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.3.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "jingood2-stage-vpc-private-ap-northeast-2a"
+           "Type"        = "Private Subnets"
+           "environment" = "stage"
+           "owners"      = "jingood2"
        }
+       tags_all                                       = {
+           "Name"        = "jingood2-stage-vpc-private-ap-northeast-2a"
+           "Type"        = "Private Subnets"
+           "environment" = "stage"
+           "owners"      = "jingood2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-northeast-2c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.3.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "jingood2-stage-vpc-private-ap-northeast-2c"
+           "Type"        = "Private Subnets"
+           "environment" = "stage"
+           "owners"      = "jingood2"
        }
+       tags_all                                       = {
+           "Name"        = "jingood2-stage-vpc-private-ap-northeast-2c"
+           "Type"        = "Private Subnets"
+           "environment" = "stage"
+           "owners"      = "jingood2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-northeast-2a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.3.101.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "jingood2-stage-vpc-public-ap-northeast-2a"
+           "Type"        = "Public Subnets"
+           "environment" = "stage"
+           "owners"      = "jingood2"
        }
+       tags_all                                       = {
+           "Name"        = "jingood2-stage-vpc-public-ap-northeast-2a"
+           "Type"        = "Public Subnets"
+           "environment" = "stage"
+           "owners"      = "jingood2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-northeast-2c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.3.102.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "jingood2-stage-vpc-public-ap-northeast-2c"
+           "Type"        = "Public Subnets"
+           "environment" = "stage"
+           "owners"      = "jingood2"
        }
+       tags_all                                       = {
+           "Name"        = "jingood2-stage-vpc-public-ap-northeast-2c"
+           "Type"        = "Public Subnets"
+           "environment" = "stage"
+           "owners"      = "jingood2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.3.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_classiclink                   = (known after apply)
+       enable_classiclink_dns_support       = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Name"        = "jingood2-stage-vpc"
+           "environment" = "stage"
+           "owners"      = "jingood2"
        }
+       tags_all                             = {
+           "Name"        = "jingood2-stage-vpc"
+           "environment" = "stage"
+           "owners"      = "jingood2"
        }
    }

Plan: 20 to add, 0 to change, 0 to destroy.
```
</details>